tap "aws/aws"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "lucagrulla/tap"
tap "saulpw/vd"
# C++ Common Libraries
brew "abseil"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Amazon CloudWatch command-line Tool
brew "cloud-watch"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Framework for scientific data networking
brew "libdap"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Cross-platform application and UI framework
brew "qt@5"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Protocol buffers library
brew "protobuf-c"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SSL tunneling program
brew "stunnel"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# General-purpose lossless data-compression library
brew "zlib"
# Utilities for Amazon Elastic File System (EFS)
brew "aws/aws/amazon-efs-utils"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# The best way to tail AWS Cloudwatch Logs from your terminal
brew "lucagrulla/tap/cw"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Universal database tool and SQL client
cask "dbeaver-community"
# OpenVPN client
cask "pritunl"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
mas "Alfred", id: 405843582
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Kindle Classic", id: 405399194
mas "LG Screen Manager", id: 1142051783
mas "Numbers", id: 409203825
mas "OneTab", id: 1540160809
mas "Pages", id: 409201541
mas "PomoDone App", id: 1096128050
mas "Ulysses", id: 1225570693
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
vscode "fabiospampinato.vscode-diff"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "vscodevim.vim"
