tap "aws/aws"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "lucagrulla/tap"
tap "saulpw/vd"
# C++ Common Libraries
brew "abseil"
# Run your GitHub Actions locally
brew "act"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Computational Geometry Algorithms Library
brew "cgal"
# Amazon CloudWatch command-line Tool
brew "cloud-watch"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# Text processing system for reStructuredText
brew "docutils"
# Modern, maintained replacement for ls
brew "eza"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# GNOME XML library
brew "libxml2"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Framework for scientific data networking
brew "libdap"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# GUI for vim, made for macOS
brew "macvim"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cross-platform application and UI framework
brew "qt@5"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Protocol buffers library
brew "protobuf-c"
# C++ wrapper library around CGAL
brew "sfcgal"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SSL tunneling program
brew "stunnel"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# General-purpose lossless data-compression library
brew "zlib"
# Utilities for Amazon Elastic File System (EFS)
brew "aws/aws/amazon-efs-utils"
# The best way to tail AWS Cloudwatch Logs from your terminal
brew "lucagrulla/tap/cw"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Universal database tool and SQL client
cask "dbeaver-community"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-ubuntu-mono-nerd-font"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
mas "Alfred", id: 405843582
mas "Fantastical", id: 975937182
mas "Kindle Classic", id: 405399194
mas "LG Screen Manager", id: 1142051783
mas "OneTab", id: 1540160809
mas "Ulysses", id: 1225570693
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
